{
    "transcript": [
        {
            "datetime": "2023-10-29T11:03:02.408510",
            "transcript": "In their own Tara court of justice. I can't stand Karen cases of how many lone child protection and Youth Court"
        },
        {
            "datetime": "2023-10-29T11:03:13.667080",
            "transcript": " In 1995 he moved from early to criminal cases while continuing to hear family child protection and youth court cases."
        },
        {
            "datetime": "2023-10-29T11:03:23.887879",
            "transcript": " He was appointed as the administrator administrative Justice for that court in several counties in eastern, Ontario."
        },
        {
            "datetime": "2023-10-29T11:03:30.026718",
            "transcript": " The November 1999. He was appointed as a judge of the superior court of justice."
        },
        {
            "datetime": "2023-10-29T11:03:48.804138",
            "transcript": " It was appointed as it I lost my place in superior court of justice of Ontario with specialization in family and child protection cases, but it was also a year in criminal and civil cases as setup."
        },
        {
            "datetime": "2023-10-29T11:03:58.921256",
            "transcript": " In 2015. He was appointed as the local administrative Justice for the Superior Court in two counties of eastern, Ontario."
        },
        {
            "datetime": "2023-10-29T11:04:04.001137",
            "transcript": " eventually retired in March 2021"
        },
        {
            "datetime": "2023-10-29T11:04:07.010415",
            "transcript": " Can eyes I call him?"
        },
        {
            "datetime": "2023-10-29T11:04:45.754336",
            "transcript": " Has been a lawyer and he is also a guest lecture at schools like Queens University students will was like to drop it like you don't want at the back just make sure you see a little lecture two different conferences and seminars and he regularly interviews children and custody and access cases has operated. So this is not a common practice in Ontario, but"
        },
        {
            "datetime": "2023-10-29T11:04:47.646573",
            "transcript": " for Kim"
        },
        {
            "datetime": "2023-10-29T11:05:07.278739",
            "transcript": " He's always toward improvements and he talked about this all weekend access to Justice. What does that mean? I mean to people I have access to Justice what does justice mean and so on Friday on Saturday afternoon yesterday evening. It was talking about all of us things."
        },
        {
            "datetime": "2023-10-29T11:05:21.143041",
            "transcript": " What can do all of these are like extras in his life? He has a believe he has a calling and I know he had a calling to be a judge but more than that."
        },
        {
            "datetime": "2023-10-29T11:05:27.837763",
            "transcript": " Turn was and as being actively involved in the Salvation Army."
        },
        {
            "datetime": "2023-10-29T11:05:59.467372",
            "transcript": " Uncles who were missionaries for 40 years all over the world. His father was a Salvation Army officer is Grandfather. I mean so can has been active in church. It was a corsage major at the Salvation Army on the first church. I started attending here in Canada. And I was there for 7 years. That's how we met in. Some people have been asking me how I'm making it was just moving chairs when I met him but"
        },
        {
            "datetime": "2023-10-29T11:06:44.766736",
            "transcript": " He is being on the board of different organisations prominent among them is international Justice Mission. It was on their board for a long time over 15 years. It was also on the board and he still is over 30 years on the board of Youth for Christ. How many of us are familiar with your for Christ? Yeah, so is being on the board of Youth for Christ for over 30 years and for me one of the three most impressive things I've heard him do is training judges in the police in Bolivar. He has been doing this for 11 years now. I think you're doing for your little trip and next year."
        },
        {
            "datetime": "2023-10-29T11:06:48.724668",
            "transcript": " Kim McGinley as I mentioned"
        },
        {
            "datetime": "2023-10-29T11:07:03.822436",
            "transcript": " For me is one of the few people in my life, very close to there's barely anything that has happened in my life. That can is not aware of he's a friend is a father. He's also my mentor"
        },
        {
            "datetime": "2023-10-29T11:07:11.942763",
            "transcript": " and beside in any successful man is a what is an even stronger woman, right?"
        },
        {
            "datetime": "2023-10-29T11:07:22.546038",
            "transcript": " Elaine wanted me to correct this but it's not a correction Mark and an addition for Elaine all of life."
        },
        {
            "datetime": "2023-10-29T11:07:29.256347",
            "transcript": " Soon as I met her and even before then she's been focused on underprivileged."
        },
        {
            "datetime": "2023-10-29T11:07:31.971511",
            "transcript": " Yes, and young people"
        },
        {
            "datetime": "2023-10-29T11:07:48.764093",
            "transcript": " When you see you later talk to kids you will understand. I mean, I could barely talk to my own kids for an hour. Alien to go hours talking to little kids not to gift and so with Elaine and Ken."
        },
        {
            "datetime": "2023-10-29T11:08:00.981692",
            "transcript": "But you have to call them projects."
        },
        {
            "datetime": "2023-10-29T11:08:20.218417",
            "transcript": " But the people who live mostly in Rito right to families of prisoners who will move to Kingston mostly other time that the time to start abusing and reader I took him to the family of the prisoners so that they have a place to stay and get to visit their family."
        },
        {
            "datetime": "2023-10-29T11:08:37.406713",
            "transcript": " Ken and Elaine moved from the Salvation Army Citadel, which is a main core and went to establish this place and kept walking and they've been there for what over ten years now."
        },
        {
            "datetime": "2023-10-29T11:08:56.319692",
            "transcript": " 16 yes thereabouts. So I want you to join me in giving Cannon Elaine a warm special North Mountain welcome as they come soon leaders in this morning sermon. Let's give a round of applause."
        },
        {
            "datetime": "2023-10-29T11:09:22.715769",
            "transcript": " There we go. Thank you. Not used to this sort of thing and I warned them. I might break out into song you never know in the back door is right there if I do."
        },
        {
            "datetime": "2023-10-29T11:09:47.422336",
            "transcript": " Thank you. Gabriel. Gabriel is very generous with his comments. But he's a very special person and he's a man of God and he's a gift to the church and I've seen him walk the walk walk the dog and really represent what it means to be a disciple of Jesus Christ, and I've known him 20 years."
        },
        {
            "datetime": "2023-10-29T11:09:58.478291",
            "transcript": " So it's been a blessing Gabriel to first of all to be invited and then to have the opportunity to come. I really enjoy this time of year."
        },
        {
            "datetime": "2023-10-29T11:10:06.028155",
            "transcript": " We're coming off a season of Thanksgiving and going into a season of remembrance."
        },
        {
            "datetime": "2023-10-29T11:10:09.840882",
            "transcript": " And those two things are very closely connected."
        },
        {
            "datetime": "2023-10-29T11:10:12.333177",
            "transcript": " Cuz we have to remember."
        },
        {
            "datetime": "2023-10-29T11:10:28.059743",
            "transcript": " And be thankful for those who have gone on. We we literally build on their shoulders and yet we also have to have our own vision and Ministry at for now and for the future and"
        },
        {
            "datetime": "2023-10-29T11:10:35.643100",
            "transcript": " it's really quite powerful to take the time and reflect on that and then so it's a special time of year."
        },
        {
            "datetime": "2023-10-29T11:10:41.630647",
            "transcript": "I'm going to"
        },
        {
            "datetime": "2023-10-29T11:10:45.390355",
            "transcript": " begin this morning"
        },
        {
            "datetime": "2023-10-29T11:10:54.093176",
            "transcript": " and in my theme is very similar to what Pastor said at the end his opening comments."
        },
        {
            "datetime": "2023-10-29T11:10:58.230082",
            "transcript": " What do we treasure?"
        },
        {
            "datetime": "2023-10-29T11:11:35.011618",
            "transcript": " And the scripture readings reflected that what two we treasure we're all looking for things of value that will give us life or at least change our lives. And so we hunt treasure in many ways and relationships careers possessions achievements education positions of power physical strength and beauty and we never seem to find that part of life satisfying that heart satisfying gold that we're looking for."
        },
        {
            "datetime": "2023-10-29T11:11:42.909716",
            "transcript": " Okay, we okay now we'll try it"
        },
        {
            "datetime": "2023-10-29T11:11:57.699592",
            "transcript": " In the I got to watch that it we don't seem to find it in the things that have been created. I created it in the created world, but sadly many many of us keep keep looking."
        },
        {
            "datetime": "2023-10-29T11:12:03.272453",
            "transcript": " Where we look for Treasures will not only controller."
        },
        {
            "datetime": "2023-10-29T11:12:07.652597",
            "transcript": " Just give me a minute. You want me to sing?"
        },
        {
            "datetime": "2023-10-29T11:12:27.624087",
            "transcript": " I'll just give me a just give us a second this work very well. The other night for me. This unit was I in here when that happened? Yeah, it worked think it was. Okay. What's good to keep going? Maybe I can turn in this away from me a bit."
        },
        {
            "datetime": "2023-10-29T11:12:49.575728",
            "transcript": " So where do we look for treasure that will not only control our heart and therefore our words and behavior, but it will also determine our destiny. Well the scripture reading and Matthew 6 told us that Matthew 6:21 for where your treasure is there. Your heart will be also."
        },
        {
            "datetime": "2023-10-29T11:12:56.786107",
            "transcript": " And it's interesting that God says that to us in his word."
        },
        {
            "datetime": "2023-10-29T11:13:16.099833",
            "transcript": "And Anchorage love treasure on Thursday. So we have this part of it's a little set of woods and what we've done is we build a little fairy land there."
        },
        {
            "datetime": "2023-10-29T11:13:37.132723",
            "transcript": " So once a year when all the grandchildren are to get there, they go and the fairies have left them gifts hanging on the trees. We learned that from earlier set of pastors of ours down in the states and they look forward to that every year and they got so excited about a treasure hunt and"
        },
        {
            "datetime": "2023-10-29T11:13:45.815971",
            "transcript": " It can be very special but with adults very often. It's discouraging."
        },
        {
            "datetime": "2023-10-29T11:13:53.801465",
            "transcript": " Hope it work our whole life even talked about that what we will work a whole life. We strive for the best."
        },
        {
            "datetime": "2023-10-29T11:14:07.739852",
            "transcript": " We sacrifice important relationships and opportunities and time while all the time seeking the wrong treasure that can happen. So easily especially in this Pagan culture that we live in."
        },
        {
            "datetime": "2023-10-29T11:14:13.503042",
            "transcript": " Jesus reminds us why what we treasure is so important."
        },
        {
            "datetime": "2023-10-29T11:14:20.169710",
            "transcript": " Jesus is not discouraging success or wealth."
        },
        {
            "datetime": "2023-10-29T11:14:46.125744",
            "transcript": " He's calling up the crowd and you and me too. And what can be one of the most awkward topics of conversations since he was on Earth and that is what we treasure and what we value. So that's the question that I want to share and I'm sharing this with myself as I speak. What do we treasure?"
        },
        {
            "datetime": "2023-10-29T11:14:55.246604",
            "transcript": " So I'm just going to quickly read again Matthews 6:19 to 21."
        },
        {
            "datetime": "2023-10-29T11:15:02.270327",
            "transcript": " Do not lay up for yourselves Treasures on Earth."
        },
        {
            "datetime": "2023-10-29T11:15:09.668393",
            "transcript": " Where moth and rust consume and where thieves break in and steal?"
        },
        {
            "datetime": "2023-10-29T11:15:26.292978",
            "transcript": " But lay up for yourselves Treasures in Heaven where neither moth nor rust consumes and where thieves do not break in and steal for where your treasure is there. Will your heart be also."
        },
        {
            "datetime": "2023-10-29T11:15:42.778305",
            "transcript": " It's interesting while we're looking for the answers to what we treasure Jesus actually starts the conversation with where our treasure is on Earth or in heaven."
        },
        {
            "datetime": "2023-10-29T11:15:47.676368",
            "transcript": " Is my heart attached to the things of Earth?"
        },
        {
            "datetime": "2023-10-29T11:15:50.186541",
            "transcript": " Are the things of Heaven?"
        },
        {
            "datetime": "2023-10-29T11:15:58.825814",
            "transcript": " And faster shared those thoughts in his introduction comments what consumes our days?"
        },
        {
            "datetime": "2023-10-29T11:16:02.765430",
            "transcript": " What we give attention to matters."
        },
        {
            "datetime": "2023-10-29T11:16:07.776291",
            "transcript": " And even more than that our choices matter."
        },
        {
            "datetime": "2023-10-29T11:16:15.983974",
            "transcript": " How we make our money how we spend our money. Are we spend our time?"
        },
        {
            "datetime": "2023-10-29T11:16:19.266177",
            "transcript": " And with whom we spend it."
        },
        {
            "datetime": "2023-10-29T11:16:24.573118",
            "transcript": " How we use your energy at all matters?"
        },
        {
            "datetime": "2023-10-29T11:16:33.778057",
            "transcript": " Number of years ago. I was invited to go down to a conference center. Just outside of New York City."
        },
        {
            "datetime": "2023-10-29T11:16:46.101987",
            "transcript": " And I was there to talk about Sunday school Outreach because I had a passion for Sunday school at reach and I was responsible for the Youth Ministry in our church."
        },
        {
            "datetime": "2023-10-29T11:16:49.880652",
            "transcript": " and I'm in the wife of the"
        },
        {
            "datetime": "2023-10-29T11:16:55.720128",
            "transcript": " Aaliyah clergy who was leading the discussion started to share"
        },
        {
            "datetime": "2023-10-29T11:17:04.021988",
            "transcript": " Her heartbreak story her heart broken story of her son her son, Billy."
        },
        {
            "datetime": "2023-10-29T11:17:09.402318",
            "transcript": " And just to think about what he'd already accomplished."
        },
        {
            "datetime": "2023-10-29T11:17:19.090343",
            "transcript": " He was in his late teens, and he had earned a scholarship to a major."
        },
        {
            "datetime": "2023-10-29T11:17:36.597751",
            "transcript": " Musical University or specialized training center there at called Juilliard. You probably heard of the school very hard to get into he was going in to piano performance at Juilliard."
        },
        {
            "datetime": "2023-10-29T11:17:51.320264",
            "transcript": " And I hear he had been just walking a friend home after some event at the high school wasn't his girlfriend, but it was a female you just walking her home keep her safe, New York City."
        },
        {
            "datetime": "2023-10-29T11:17:58.405952",
            "transcript": " Some guy comes out of the shadows and starts hitting him with a hammer."
        },
        {
            "datetime": "2023-10-29T11:18:03.729872",
            "transcript": " So Billy puts up his hands to protect his head."
        },
        {
            "datetime": "2023-10-29T11:18:12.022750",
            "transcript": "Use of one of his fingers."
        },
        {
            "datetime": "2023-10-29T11:18:24.006663",
            "transcript": " I took away his future. It took away Juilliard and his dream to be a professional musician at a very high level."
        },
        {
            "datetime": "2023-10-29T11:18:27.202410",
            "transcript": " So that devastated Billy."
        },
        {
            "datetime": "2023-10-29T11:18:43.418475",
            "transcript": " His dreams were going to talk about five surgeries trying to get it to work, but it never came back that the finger was there, but it just didn't work and when she was talking to me. He had actually left home."
        },
        {
            "datetime": "2023-10-29T11:18:55.981833",
            "transcript": " and he was living in empty Salvation Army buildings in the New York area that he knew about cuz his parents were officers and in charge of the area there and"
        },
        {
            "datetime": "2023-10-29T11:19:04.926261",
            "transcript": " He would go back to that same neighbourhood and wave in the darkness with a hammer. Hoping to see that guy."
        },
        {
            "datetime": "2023-10-29T11:19:11.828889",
            "transcript": " This is a blond-haired blue-eyed All-American kit."
        },
        {
            "datetime": "2023-10-29T11:19:15.674603",
            "transcript": " his mother would send"
        },
        {
            "datetime": "2023-10-29T11:19:27.342574",
            "transcript": " little package care packages to him and find out where he was staying and send care packages to her heart was broken and I'm thinking Philly."
        },
        {
            "datetime": "2023-10-29T11:19:29.664698",
            "transcript": " What's going on?"
        },
        {
            "datetime": "2023-10-29T11:19:47.369414",
            "transcript": " If you got these parents are wonderful people gifted people. She been an opera singer her father's just a spectacular speaker and executive in the Salvation Army in leadership, and I'm thinking Billy what's going on, man?"
        },
        {
            "datetime": "2023-10-29T11:19:49.978279",
            "transcript": " is it because"
        },
        {
            "datetime": "2023-10-29T11:19:53.517940",
            "transcript": " Your music had become your Idol."
        },
        {
            "datetime": "2023-10-29T11:20:07.218672",
            "transcript": " Did it take over really what you could have used it for from the Lord but the hear her story. She wasn't given up on them. She was praying for him and supporting him the best she could."
        },
        {
            "datetime": "2023-10-29T11:20:10.997507",
            "transcript": " But it really bothered me and she was heartbroken."
        },
        {
            "datetime": "2023-10-29T11:20:33.542096",
            "transcript": " And I am the only conclusion I drew was you know that dream that it had been it's a good thing to be a talent that have a gift from God. It's a good thing to develop that talent to use it but when it comes to that point in your life, it seems to be over value."
        },
        {
            "datetime": "2023-10-29T11:20:40.506727",
            "transcript": " So instead of asking, you know, what do I treasure we should be asking what this God treasure?"
        },
        {
            "datetime": "2023-10-29T11:20:58.664016",
            "transcript": " And if that question what this God treasure becomes are foundational question and many decisions in our relationships are Behavior or actions. We start changing our thinking from how I going to spend my money or how am I going to spend God's money?"
        },
        {
            "datetime": "2023-10-29T11:21:08.992809",
            "transcript": " Bishop from home I going to spend my time to how am I going to use my time to bring glory to God?"
        },
        {
            "datetime": "2023-10-29T11:21:18.392220",
            "transcript": " How am I going to treat that person is change the how would God want me to treat that person whether they're your friend or your enemy?"
        },
        {
            "datetime": "2023-10-29T11:21:26.848949",
            "transcript": " It's all there in scripture what we treasure should line up with what God treasures and our culture."
        },
        {
            "datetime": "2023-10-29T11:21:36.052042",
            "transcript": " It's just Ledger usually saved crazy, but it's just Ledger focused and the acquisition of wealth."
        },
        {
            "datetime": "2023-10-29T11:21:52.249639",
            "transcript": " You know, we're looking for money toys entertainment the culture clothes stuff all that create things created in this world. None of that's going to last like a reverse 20 just said what happens modest breastfeeds."
        },
        {
            "datetime": "2023-10-29T11:21:55.169800",
            "transcript": " things those things don't last"
        },
        {
            "datetime": "2023-10-29T11:22:22.732490",
            "transcript": " and it's just the reality that we're in a culture that influences of so much. So what do we treasure because what we treasure is what holds our hearts it motivates us. It moves us to sacrifice. You're always prepared to give up something for your treasure. And that's where Matthew 13 comes in and give you a read those verses too, and I'm just going to look at them again."
        },
        {
            "datetime": "2023-10-29T11:22:36.632056",
            "transcript": " About the search for these items of Great Value the Kingdom of Heaven at verse 44 is like treasure hidden in a field with your man found and cover it up."
        },
        {
            "datetime": "2023-10-29T11:22:44.139646",
            "transcript": " Then in his Joy, he goes and sells all that he has and buys that field."
        },
        {
            "datetime": "2023-10-29T11:22:57.999149",
            "transcript": " Again, the Kingdom of Heaven is like a merchant in search of fine pearls who on finding one pearl of Great Value went and sold all that. He had and bought it."
        },
        {
            "datetime": "2023-10-29T11:23:08.886083",
            "transcript": " We make sacrifices every day for things we think are important and valuable."
        },
        {
            "datetime": "2023-10-29T11:23:13.773539",
            "transcript": " No one lives a sacrifice free life."
        },
        {
            "datetime": "2023-10-29T11:23:20.812446",
            "transcript": "Fine and that's fine. As long as the purpose is good and you're"
        },
        {
            "datetime": "2023-10-29T11:23:38.152567",
            "transcript": " thoughts behind that your attitude and your motivation is good. And as long as we keep giving the best to the Lord, but you don't feel as you don't live a life without sacrificing. It's okay for the right purpose."
        },
        {
            "datetime": "2023-10-29T11:23:47.701332",
            "transcript": " Anything worth doing is going to cause sacrifice involve some cost."
        },
        {
            "datetime": "2023-10-29T11:24:10.501907",
            "transcript": " So what do we treasure are we sacrificing for the right and holy sacred treasure that God has for us only one treasure meets God standards and the devil is going to do everything. You can to convince you that the sacrifice for service to the Lord isn't worth it. But that's a lie. It's an absolute lie."
        },
        {
            "datetime": "2023-10-29T11:24:16.023748",
            "transcript": " You'll never regret matching up your heart with the will of God."
        },
        {
            "datetime": "2023-10-29T11:24:44.688202",
            "transcript": " Talking about it on the way in this morning humble acts of service. I'm worth more than go off. I see it in this church, by the way, I've only been here for a weekend, but I see some people in this church are doing that and they're not necessarily the ones up here talking about those people do it too. But there's a lot of people that are giving up and humble acts of service."
        },
        {
            "datetime": "2023-10-29T11:24:50.108148",
            "transcript": " But God season and God honors it and uses it."
        },
        {
            "datetime": "2023-10-29T11:25:05.855353",
            "transcript": " So one of Satan's greatest games has to take good things gifts that God created like Billy had in his capacity to be such an upstanding musician."
        },
        {
            "datetime": "2023-10-29T11:25:16.224715",
            "transcript": " And convince you they're more important than God things like even Ministry our family our relationships career our good works."
        },
        {
            "datetime": "2023-10-29T11:25:26.729313",
            "transcript": " In fact, they are all good. But when they take the place of God become the thing that you treasure that thing captures your heart watch out."
        },
        {
            "datetime": "2023-10-29T11:25:32.772939",
            "transcript": " Satan can take that good thing and fashioned it into an idol and your heart."
        },
        {
            "datetime": "2023-10-29T11:25:37.714075",
            "transcript": " So I have to ask myself. Is there anything in my life?"
        },
        {
            "datetime": "2023-10-29T11:25:43.944362",
            "transcript": " That has become an idle sometimes that I might treasure above God."
        },
        {
            "datetime": "2023-10-29T11:26:01.260395",
            "transcript": " When Jesus is our savior, he is first Jesus is the treasure. He is our first love for everything and everyone else we should pray and ask the Lord. How can I be a good Steward of the things that you have brought in my life?"
        },
        {
            "datetime": "2023-10-29T11:26:15.146165",
            "transcript": " Now for several years, we had a tradition we live in just outside of Kingston, Ontario, but 3-hour drive to Toronto and we've been go in at Christmas time."
        },
        {
            "datetime": "2023-10-29T11:26:32.193887",
            "transcript": " For a day with the Salvation Army they call it and sometimes it was actually put on CBC television broadcast. They wanted Android Thompson Hall which isn't the major concert facility in Toronto."
        },
        {
            "datetime": "2023-10-29T11:26:39.691337",
            "transcript": " Maybe we would go in and sing in a fire talking about choirs for Christmas 300 voices."
        },
        {
            "datetime": "2023-10-29T11:26:57.335166",
            "transcript": " We joined with the other churches and went together. That's pretty neat sing the bass part and you started Bass by was about 70 other guys. It's like something real special. Don't show up for that Christmas choir."
        },
        {
            "datetime": "2023-10-29T11:27:23.836126",
            "transcript": " I start saying to prove its worth it, but I won't anyway, this was one real special event there because they were at the head and some gas and one of the guests was the leader of the international staff band Salvation Army of the England press bands basically started over there, you know, they have brass man competition to sort of the."
        },
        {
            "datetime": "2023-10-29T11:27:42.801572",
            "transcript": " Like hockey for us in terms of Love at something at end and they they love Christ fans and he was coming to leave the Canadian Brass Band, which is a world-class than there was a former governor general of the province of Ontario going to get an award of appreciation from the salvation."
        },
        {
            "datetime": "2023-10-29T11:27:48.913931",
            "transcript": " And they always have a guest artist musician."
        },
        {
            "datetime": "2023-10-29T11:27:55.465821",
            "transcript": " And I didn't know till we got there. It was just born died."
        },
        {
            "datetime": "2023-10-29T11:28:00.604451",
            "transcript": " blue eyes blonde hair kid from New York"
        },
        {
            "datetime": "2023-10-29T11:28:02.702020",
            "transcript": " It was Billy."
        },
        {
            "datetime": "2023-10-29T11:28:05.542337",
            "transcript": " And I saw his mom there with him."
        },
        {
            "datetime": "2023-10-29T11:28:08.304762",
            "transcript": " and he's been"
        },
        {
            "datetime": "2023-10-29T11:28:10.097855",
            "transcript": " heels"
        },
        {
            "datetime": "2023-10-29T11:28:35.583255",
            "transcript": "Are in the world and I've actually got that on a VHS tape of that night cuz it was broadcast on CBC and there's Billy playing at the piano. It's Remy uniform and giving his testimony."
        },
        {
            "datetime": "2023-10-29T11:28:37.433614",
            "transcript": " Yeah."
        },
        {
            "datetime": "2023-10-29T11:28:52.712155",
            "transcript": " What a blessing. I met him a couple other times. I met him at a conference Salvation Army conference in Winnipeg and he was at that time Church different Church in somewhere in New England, and he was their music player."
        },
        {
            "datetime": "2023-10-29T11:29:19.147167",
            "transcript": " And then I met his parents again little while later and he'd become a Salvation Army officer. Guess what he married an opera singer just like his mom and they were the pastors at the Time Square core in New York and just off Times Square just steps off at Time Square to the Salvation Army have this ministry to the Arts community."
        },
        {
            "datetime": "2023-10-29T11:29:40.990912",
            "transcript": " In Times Square in downtown New York. I've actually been there for a meeting and we met about the fifth floor in a dance studio. If it's to the Arts Community region and Billy and his wife at the time were there and the young people from that Community just flocking to them."
        },
        {
            "datetime": "2023-10-29T11:29:49.561966",
            "transcript": " Abraham not physically, but spiritually"
        },
        {
            "datetime": "2023-10-29T11:30:17.266897",
            "transcript": " What a gift in the Salvation Army. We talked about being saved to serve. That's what he was doing with that gift. He was serving and that was his treasure and it's been turned over to the Lord and what a powerful Ministry had and I love this guy. My son who's a professor of Theology and Toronto? He's met Billy several times at different conferences e amazing amazing guy."
        },
        {
            "datetime": "2023-10-29T11:30:25.439808",
            "transcript": " God wants each of us to bring that kind of dedication to every area of Our Lives."
        },
        {
            "datetime": "2023-10-29T11:30:27.669401",
            "transcript": " and of our hearts"
        },
        {
            "datetime": "2023-10-29T11:31:11.199759",
            "transcript": " I'll tell you a story about one of the president's former presidents of Asbury College. You people to be aware of the renewal that went on there the last year. So I asked for a a real moving on the Holy Spirit. I watch hours and hours of it on TV is quite powerful. I woke up one Saturday morning this past just after that experience and in my mind, I'm literally thinking I have no idea why the president of Asbury College. I don't know the price. I wouldn't know the president of a college if they came inside here."
        },
        {
            "datetime": "2023-10-29T11:31:14.086466",
            "transcript": " I checked my aunt. What was I thinking about?"
        },
        {
            "datetime": "2023-10-29T11:31:47.210951",
            "transcript": " Why was that on my mind and I'm going to speak at our church and I was looking for an illustration of something like this that made sense to me. And then I thought we wait a minute. I remember David garrettson. He was a former president of Asbury College and I heard him give his testimony at a Salvation Army conference. I was attending just know that Ron is the president there from 1993 to 2000, but he gave his testimony."
        },
        {
            "datetime": "2023-10-29T11:31:54.380898",
            "transcript": " He grew up in a fairly small community in Northern Ontario, Timmins, Ontario."
        },
        {
            "datetime": "2023-10-29T11:31:59.356332",
            "transcript": " And I had a hard life dysfunctional home alcoholic mother."
        },
        {
            "datetime": "2023-10-29T11:32:03.046551",
            "transcript": " father who abandoned the family"
        },
        {
            "datetime": "2023-10-29T11:32:13.428052",
            "transcript": " He wasn't doing well in school. His mother had different male partners that we're coming into and out of his life it was."
        },
        {
            "datetime": "2023-10-29T11:32:16.544301",
            "transcript": " struggling academically"
        },
        {
            "datetime": "2023-10-29T11:32:18.638729",
            "transcript": " He was in trouble."
        },
        {
            "datetime": "2023-10-29T11:32:25.412726",
            "transcript": " He was eleven years old when he came home one day and all his belongings were on the lawn."
        },
        {
            "datetime": "2023-10-29T11:32:30.625140",
            "transcript": " Mother said you're no good."
        },
        {
            "datetime": "2023-10-29T11:32:35.445551",
            "transcript": " You're not welcome here."
        },
        {
            "datetime": "2023-10-29T11:32:48.501790",
            "transcript": " We don't even want to hear from you or ever see you again. So I went to live on the streets at 11 years old. I need a didn't get picked up by Cas. He lived on the streets."
        },
        {
            "datetime": "2023-10-29T11:32:50.377009",
            "transcript": " my butt"
        },
        {
            "datetime": "2023-10-29T11:32:52.963888",
            "transcript": " 02 years"
        },
        {
            "datetime": "2023-10-29T11:32:57.957197",
            "transcript": " And then Free Methodist minister."
        },
        {
            "datetime": "2023-10-29T11:33:04.692453",
            "transcript": " Pastor and his wife took him in. They took this young guy David in."
        },
        {
            "datetime": "2023-10-29T11:33:50.763209",
            "transcript": "Marion small congregation folks Free Methodist church, and just to let you know that he had another another congregation 65 miles away. They also was responsible for he made $400 a month and all the moose meat. He could eat his way. He put it to take care of these two congregations. It was stuff. So his wife when I have to work."
        },
        {
            "datetime": "2023-10-29T11:33:55.625341",
            "transcript": " As I am a nurse's aide. I think it was in a hospital."
        },
        {
            "datetime": "2023-10-29T11:33:59.743436",
            "transcript": " but anyway"
        },
        {
            "datetime": "2023-10-29T11:34:19.670497",
            "transcript": " This is David does youngboy off the streets loved and he loved it there the first time he'd ever been recognized as they first time you'd ever been appreciated and it had some awareness of the church had a little bit of experience. I think attending an Anglican Church."
        },
        {
            "datetime": "2023-10-29T11:34:50.636230",
            "transcript": " And he remembered when he was talking at the Salvation Army conference, you said I remember this guy from The Salvation Army. He was kind of short and stocky and he came to us every Christmas and give us a hand free with food in in the turkey in it and gifts and everything and he's kind of a funny little guy and he nailed down on the front steps and he say hey Sonny, you know what these two s's or 4 cuz I want to tell me if I was home. I have myself some uniform and Jeanette's here and in this here."
        },
        {
            "datetime": "2023-10-29T11:34:53.368770",
            "transcript": " That doesn't mean Super Soldier."
        },
        {
            "datetime": "2023-10-29T11:34:56.756075",
            "transcript": " That means saved to serve."
        },
        {
            "datetime": "2023-10-29T11:35:45.251397",
            "transcript": " So it was Johnny he had those two asses and for some reason that stuff from David's mind and when he was about 15 him and the pastor was sitting up late one night waiting for his wife to come home. And he said what we usually did was set and we drank some tea and ate some toast burnt toast. That was our tradition. I don't know why but it was waiting for her to come home. He's in he looked depressed in the Pastor said like what's going on? He said well, like I'm useless. I'm not getting anywhere in life. I'm going nowhere. I'm thinking one of the things they left on the lawn for him with a hunting rifle."
        },
        {
            "datetime": "2023-10-29T11:35:52.059893",
            "transcript": " And I'm thinking of taking my rifle and going out into the woods. I got no future."
        },
        {
            "datetime": "2023-10-29T11:36:18.475739",
            "transcript": " I'm a mess. I feel like giving up so the Reverend right away got his Bible and he opened it up the song 27 verse 10. I can't say that this song ever stood out to me after this first before but he read it to David this young man when my father father and mother have forsaken me."
        },
        {
            "datetime": "2023-10-29T11:36:21.142347",
            "transcript": " Then the Lord will take me up."
        },
        {
            "datetime": "2023-10-29T11:36:41.473750",
            "transcript": " And the Holy Spirit spoke to that young man, and he ends up being a pastor and he ends up being president of several universities. You had a worldwide reputation has written books and everything and for a while. He was pastoring a very large prominent free."
        },
        {
            "datetime": "2023-10-29T11:37:17.805307",
            "transcript": " Freedom Ministries church in Toronto and Jarvis Street downtown and because of his connection to the Salvation Army with that little guy saying you don't save to serve Dom every Chris even go to the Salvation Army Harbor Light Inn in preaching Harbor Light is the residential addictions treatment program. We have one in Kingston may have one in Toronto and the deal at Toronto was you want free meal. You got to come to church first step a little chapel service a"
        },
        {
            "datetime": "2023-10-29T11:37:37.698022",
            "transcript": " Anyway, she's there one night and he's preaching and in the Salvation Army tradition. They made an invitation for people want to accept price to come forward. We have a call through there just a plain wooden bench and was called The Mercy Seat, which is a very biblical term."
        },
        {
            "datetime": "2023-10-29T11:37:41.824039",
            "transcript": " And the same Emma gave the invitation. Nobody came for"
        },
        {
            "datetime": "2023-10-29T11:37:47.104058",
            "transcript": " the little captain in charge of their service at night. He said Reverend."
        },
        {
            "datetime": "2023-10-29T11:37:51.174162",
            "transcript": " Give me a meditation one more time."
        },
        {
            "datetime": "2023-10-29T11:38:00.876379",
            "transcript": " And someone stood up at the back and some and of course, he starts coming to the front and is he gets closer David?"
        },
        {
            "datetime": "2023-10-29T11:38:03.864231",
            "transcript": " Recognizes, it's his father."
        },
        {
            "datetime": "2023-10-29T11:38:07.453871",
            "transcript": " Haven't seen him for years."
        },
        {
            "datetime": "2023-10-29T11:38:16.754994",
            "transcript": " Any wedding braids with him at the altar and his father accepted Christ and lived out his life working for the Salvation Army."
        },
        {
            "datetime": "2023-10-29T11:38:19.269796",
            "transcript": " Until he died."
        },
        {
            "datetime": "2023-10-29T11:38:22.737858",
            "transcript": " Yeah."
        },
        {
            "datetime": "2023-10-29T11:38:28.939900",
            "transcript": " saved to serve"
        },
        {
            "datetime": "2023-10-29T11:38:35.556763",
            "transcript": "Colossians 3 1 2 3"
        },
        {
            "datetime": "2023-10-29T11:38:55.543813",
            "transcript": " says this since then you have been raised with Christ set your hearts on things above where Christ is seated at the right hand of God set your minds on things above not on things Earthly things for you died. And your life is now hidden with Christ in God."
        },
        {
            "datetime": "2023-10-29T11:39:09.892486",
            "transcript": " We look up we don't look down and where is your treasure? Where do we need to make adjustments in our lives to line our heart up with the heart of God?"
        },
        {
            "datetime": "2023-10-29T11:39:18.550508",
            "transcript": " In a closed with one more illustration. This is a story about a young man from South America's as"
        },
        {
            "datetime": "2023-10-29T11:39:31.080806",
            "transcript": " give me a mansion. I've been working in South America and Bolivia since I actually since 2007 and the last time there was 2019 and once we had"
        },
        {
            "datetime": "2023-10-29T11:40:00.940179",
            "transcript": " go to let you know we're actually there was a political Uprising we had to literally flee the last time we were there. But anyway, we're hoping to go back and I'm committed to going back next year. We haven't got a memorandum of understanding signed with any of the government, but we made a difference because some of the we did the first data base study of the judicial system court system in the history of Bolivia."
        },
        {
            "datetime": "2023-10-29T11:40:18.652778",
            "transcript": " And we had Bolivian judges and Court staff away on seminars their recommendations coming out of our discussions were amazing and some of them we found out in 2019 have been put into law. So we are making a difference."
        },
        {
            "datetime": "2023-10-29T11:40:25.085086",
            "transcript": " But anyway, this is this particular little example that I'm closing with was from Brazil."
        },
        {
            "datetime": "2023-10-29T11:40:40.565558",
            "transcript": " And it's Elsa. It's a story that came through from a Canadian who was the worldwide leader of the Salvation Army. We've had I think at least three of them four of them. Hope for Canadians have been l number 1 just retired."
        },
        {
            "datetime": "2023-10-29T11:40:54.819712",
            "transcript": " But this wasn't a story he came that comes out of Priscilla by the young man named Paolo and I'll share this is a closing example of what it means."
        },
        {
            "datetime": "2023-10-29T11:40:59.238288",
            "transcript": " the turn your life over to the Lord and the difference you can make"
        },
        {
            "datetime": "2023-10-29T11:41:07.891087",
            "transcript": " Sao Paulo when still quite young became involved in a local gang and became hooked on drugs"
        },
        {
            "datetime": "2023-10-29T11:41:30.768983",
            "transcript": " While walking along the street seems attracted when they buy the sound of singing and soon found himself for the first time and it's Salvation Army meeting when they alter call. The invitation was given he responded though. Not fully aware of all the implications of such a decision and so began a long process of healing Within"
        },
        {
            "datetime": "2023-10-29T11:42:05.591826",
            "transcript": " Patient patience the pasture. They're the captain minister to his new convert follow had many ups and downs, but eventually the battle was when he made a complete surrender to Christ. His life was visibly changed eventually. He asked could he become a soldier a full member of the Salvation Army and the general the worldwide head of the Salvation Army's coming. He's coming in coming soon here, and maybe he can be the one."
        },
        {
            "datetime": "2023-10-29T11:42:08.325907",
            "transcript": " To enroll you as a soldier."
        },
        {
            "datetime": "2023-10-29T11:42:13.580909",
            "transcript": " Paulo had one more request could he have two s's?"
        },
        {
            "datetime": "2023-10-29T11:42:28.379152",
            "transcript": " I'm familiar to us has to wear on his white shirt wasn't a Salvation Army uniform. He wasn't allowed to wear one yet cuz it wasn't a soldier yet, and he wanted to wanted to call her. She was given these asses."
        },
        {
            "datetime": "2023-10-29T11:42:36.374466",
            "transcript": " Anyone out in the streets to witness for Christ. However, within a short time he was back at the Captain's home."
        },
        {
            "datetime": "2023-10-29T11:42:39.289514",
            "transcript": " and the Gang that he had been a member of"
        },
        {
            "datetime": "2023-10-29T11:42:47.693977",
            "transcript": " they said they saw me with the SS on they told me if I insisted on wearing them. They're going to beat me up."
        },
        {
            "datetime": "2023-10-29T11:42:52.546310",
            "transcript": " So what should I do while I got and says you got three choices?"
        },
        {
            "datetime": "2023-10-29T11:43:00.608403",
            "transcript": " You can take off the SS you can take the beating you can fight the gang if they attack you so late that night."
        },
        {
            "datetime": "2023-10-29T11:43:13.379068",
            "transcript": " Follow shows up at the Captain's House. He has a great big gash on his forehead and he's bleeding and it sure it's torn and he was smiling."
        },
        {
            "datetime": "2023-10-29T11:43:21.652058",
            "transcript": " And he says I did as Jesus would have done they beat me up, but I told him I love them just the same."
        },
        {
            "datetime": "2023-10-29T11:43:26.530854",
            "transcript": " How did you get that terrible cut on your forehead that got finesse?"
        },
        {
            "datetime": "2023-10-29T11:43:38.800181",
            "transcript": "my soulmate dad"
        },
        {
            "datetime": "2023-10-29T11:43:53.640537",
            "transcript": " and general Wiseman said later when I accepted follow as one of God's soldiers in the Army observe the S on his forehead and recalled another man named Paul."
        },
        {
            "datetime": "2023-10-29T11:44:00.770724",
            "transcript": " Who Proclaim proudly that he bore in his body the marks of the Lord Jesus?"
        },
        {
            "datetime": "2023-10-29T11:44:03.761569",
            "transcript": " the new Soldier"
        },
        {
            "datetime": "2023-10-29T11:44:07.970423",
            "transcript": " Jesus Christ was in pretty good company."
        },
        {
            "datetime": "2023-10-29T11:44:24.692975",
            "transcript": " The word compassion literally means to suffer with and dust to identify with people. We must be prepared to meet people at their own point of need as they shared over the weekend the scripture that says you should"
        },
        {
            "datetime": "2023-10-29T11:44:32.733110",
            "transcript": " treat the people in prison as if you're in prison with them when you visit them which were commanded to do."
        },
        {
            "datetime": "2023-10-29T11:44:43.759911",
            "transcript": " So we most often there's nothing wrong with it. We pray for physical healing for ourselves and loved ones. Your prayer list full of that. Our prayer list is full of that is nothing wrong with that."
        },
        {
            "datetime": "2023-10-29T11:45:03.866306",
            "transcript": " That's fine. But we also need to go beyond that to pray that God will help us in our strength and our courage and our boldness to help others at their point of need. Another worldwide leader of the Salvation. Army was a Canadian and really I really love this guy and his wife."
        },
        {
            "datetime": "2023-10-29T11:45:13.638986",
            "transcript": " Gene Brown said this a little girl finished your prayer by saying and now dear God. What can I do for you?"
        },
        {
            "datetime": "2023-10-29T11:45:17.733220",
            "transcript": " I think we need to pray that everyday."
        },
        {
            "datetime": "2023-10-29T11:45:20.543699",
            "transcript": " That will all be saved to serve."
        },
        {
            "datetime": "2023-10-29T11:45:25.937651",
            "transcript": " I think we're going to we're going to close with a song."
        },
        {
            "datetime": "2023-10-29T11:45:48.780501",
            "transcript": " When I Survey is that correct the Wondrous Cross by the way I asked for that it's an Isaac Watts song at the hymns probably 300 you I think it's over three hundred years old what a classic it speaks of where our treasure is and if storing up Treasures in Heaven like Paul the Apostle my riches games I count but lost"
        },
        {
            "datetime": "2023-10-29T11:45:57.356012",
            "transcript": " I like this song sung at my funeral by the way, if anybody's there, I never told anybody that before I don't think"
        },
        {
            "datetime": "2023-10-29T11:46:17.935316",
            "transcript": " So it may be your moment Tonight Eric this morning just to get maybe even accept Christ in your heart as you're in your seat. When we sit As we sing this powerful work or to rededicate your life to being safe to serve you may want to do that as we sing together and may God move in our hearts."
        },
        {
            "datetime": "2023-10-29T11:46:24.486742",
            "transcript": " And speak to us and only in the way only he can to God bless you."
        },
        {
            "datetime": "2023-10-29T11:46:34.130958",
            "transcript": " Let's Stand Together."
        },
        {
            "datetime": "2023-10-29T11:47:03.422167",
            "transcript": " friend"
        },
        {
            "datetime": "2023-10-29T11:47:48.852006",
            "transcript": ""
        },
        {
            "datetime": "2023-10-29T11:48:25.556682",
            "transcript": "Where the whole oral?"
        },
        {
            "datetime": "2023-10-29T11:49:27.406615",
            "transcript": "Hey, man, I'm sure God has been speaking to some of us this morning. There's some thank you for those stories near your words this morning."
        },
        {
            "datetime": "2023-10-29T11:49:38.964596",
            "transcript": " We've been given a lot and there is much Brokenness in our world that God wants us to be apart of serving and helping to for them to see Jesus."
        },
        {
            "datetime": "2023-10-29T11:49:47.666755",
            "transcript": " Just a reminder that we do have a meeting for our Refugee committee immediately afterwards and Then followed by a board meeting."
        },
        {
            "datetime": "2023-10-29T11:49:53.976489",
            "transcript": " Now may God bless your eyes with site that you may see."
        },
        {
            "datetime": "2023-10-29T11:50:04.241405",
            "transcript": " Her face in every living being may God strengthen your soul with courage that you may never fear the forces of hate and Division."
        },
        {
            "datetime": "2023-10-29T11:50:29.444111",
            "transcript": " May God fill your heart with love that you may go forth to do his work a peace and Reconciliation and may the god of neighbour and stranger who was and is and always shall be his father of us all be with you and bless you and bring you Joy and all the days your life in the name of the father and son and holy spirit. Amen. You may be seated."
        }
    ],
    "languages": {}
}